

// : 여러개의 아이템 추옵 확인시 중복되는 아이템을 확인하는 경우 혹은 아이템을 제대로 확인하지 못하는 경우를 방지하기 위해
//  이전에 비교한 아이템과 같을 경우 다시 시도하도록 로직 수정

// TODO: 자동 숙련도 올리는 작업시 아이템 이름이 없는경우도 아이템 제작 안하도록 수정

// TODO: 무한 합성시 비 정렬 상태에서도 아이템을 스캔하여 진행하도록 수정
// TODO: 무한 합성시 특정 아이템 제외하고 합성하도록 수정

// TODO: 주문서목록 사용하여 강화시 파일에 "주문서위치 스타포스수치" 형식으로 입력하여 사용하도록 수정

// TODO: F1 버튼으로 아이템 시세 확인시 최적가는 항상 계산하여 보여주기
// TODO: 아이템 재등록시 감가 수준을 좀더 효과적으로 적용하는방법 생각해보기

// TODO: 아이템 정보 수집시 잠재능력 수치도 판단하기 (꼭 필요한가 생각 한번 해보고 결정)

// TODO: 로그아웃(fast) 더 빠르게 만들기

// TODO: settings  파일 저장시 보기 편하게 바꾸기